# D4. 15761 크고 작은 이진수의 곱셈


T = int(input())


# 여러개의 테스트 케이스가 주어지므로, 각각을 처리합니다.
for test_case in range(1, T + 1):
    # ///////////////////////////////////////////////////////////////////////////////////

    a, b = map(int, input().split())
    M = '1'
    m = '1'
    a -= 1
    M = '0b' + M + '1' * a + '0' * b
    m = '0b' + m + '0' * b + '1' * a
    # print(M, m)

    num = int(M, 2) * int(m, 2)
    answer = 0
    for i in bin(num):
        if i == '1':
            answer += 1

    print('#'+str(test_case), answer)



    # ///////////////////////////////////////////////////////////////////////////////////